# Рост взрослого населения города X имеет нормальное распределение.
# Причем, средний рост равен 174 см, а среднее квадратичное отклонение равно 8 см.
# Какова вероятность того, что случайным образом выбранный взрослый человек имеет рост:
# а). больше 182 см
# б). больше 190 см
# в). от 166 см до 190 см
# г). от 166 см до 182 см
# д). от 158 см до 190 см
# е). не выше 150 см или не ниже 190 см
# ё). не выше 150 см или не ниже 198 см
# ж). ниже 166 см.
print('А')
# А. Больше 182 см.
Z1 = (182 - 174) / 8
print(Z1) # 1
p1 = 1 - 0.8412 
print(p1) # 1587
print('Б')
#Б. Больше 190 см.
Z2 = (190 - 174) / 8
print(Z2) # 2 
p2 = 1 - 0.9773
print(p2) # 0.0227
print('В')
# В. От 166 до 190
Z3 = (166 - 174) / 8
print(Z3) # -1
p3 = 0.1587
print(p3) # 0.1587
Z33 = (190 - 174) / 8 
print(Z33) # 2
p4 = 0.9773
print(p4) # 0.9773
p5 = p4 - p3 
print(p5) # 0.8186
print('Г')
# Г. От 166 до 182
Z4 = (166 - 174) / 8
print(Z4) # -1
p6 = 0.1587
print(p6) # 0.1587
Z44 = (182 - 174) / 8 
print(Z44) # 1
p7 = 0.8413
print(p7) # 0.8413
p8 = p7 - p6
print(p8) # 0.6826
print('Д')
# Д. От 158 до 190 см.
Z5 = (158 - 174) / 8
print(Z5) # -2
p9 = 0.0228
print(p9) # 0.0228
Z55 = (190 - 174) / 8
print(Z55) # 2
p10 = 0.9773
print(p10) # 0.9773
p11 = p10 - p9
print(p11) # 0.9545
print('Е')
# Е. Не выше 150 см или не ниже 190 см.
Z6 = (150 - 174) / 8
print(Z6) # -3
p12 = 0.0013
print(p12) # 0.0013
Z7 = (190 - 174) / 8
print(Z7) # 2
p13 = 1 - 0.9773
print(p13) # 0.0227
p14 = p12 + p13
print(p14) # 0.0240
print('Ё')
# Ё. Не выше 150 или не ниже 198 см.
Z8 = (150-174) / 8
print(Z8) # -3 
p15 = 0.0013
print(p15) # 0.0013
Z9 = (198 - 174) / 8
print(Z9) # 3
p16 = 1 - 0.9987 
print(p16) # 0.00129
p17 = p15 + p16
print(p17) # 0.00259
print('Ж')
# Ж. Ниже 166 см.
Z10 = (166 - 174) / 8
print(Z10) # -1
p18 = 0.1587
print(p18) # 0.1587
